IDENTIFICATION DIVISION.
PROGRAM-ID. HolaMundo.

ENVIRONMENT DIVISION.

DATA DIVISION.

PROCEDURE DIVISION.
    DISPLAY "¡Hola, mundo!".
    STOP RUN.